packages/react/testing/mutants/m3-tooltip-after-create.patch
--- a/packages/react/src/charts/helpers/useChart.js
+++ b/packages/react/src/charts/helpers/useChart.js
@@ -86,6 +86,7 @@
             data,
             configuration
         );
+        createTooltip();
     });
 
     // Mount and unmount only. Nothing the cleanup reads may come from a render
