packages/react/testing/mutants/m6-tooltip-child-not-memoised.patch
--- a/packages/react/src/charts/tooltip/Tooltip.js
+++ b/packages/react/src/charts/tooltip/Tooltip.js
@@ -141,7 +141,7 @@
     // mouse handlers, plus createTooltip for the chart to call once it has
     // drawn (or redrawn) its groups. The handlers are plain closures over the
     // props they were built from: they are rebuilt whenever the props change.
-    if (props.render && props !== childChart.current.props) {
+    if (props.render) {
         childChart.current = {
             props,
             element: props.render({
